package jp.gr.procon.proconapp.model;

import com.google.gson.annotations.SerializedName;

import java.io.Serializable;

public class Player implements Serializable {

    @SerializedName("id")
    private Long mId;

    @SerializedName("name")
    private String mName;

    @SerializedName("short_name")
    private String mShortName;

    public Long getId() {
        return mId;
    }

    public String getName() {
        return mName;
    }

    public String getShortName() {
        return mShortName;
    }

    // TODO APIから取得するように変更
    public static String getPlayerList() {
        return "[\n" +
                "  {\n" +
                "    \"id\": 30010,\n" +
                "    \"name\": \"苫小牧工業高等専門学校\",\n" +
                "    \"short_name\": \"苫小牧\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30021,\n" +
                "    \"name\": \"旭川工業高等専門学校\",\n" +
                "    \"short_name\": \"旭川\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30029,\n" +
                "    \"name\": \"函館工業高等専門学校\",\n" +
                "    \"short_name\": \"函館\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30055,\n" +
                "    \"name\": \"釧路工業高等専門学校\",\n" +
                "    \"short_name\": \"釧路\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30008,\n" +
                "    \"name\": \"八戸工業高等専門学校\",\n" +
                "    \"short_name\": \"八戸\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30038,\n" +
                "    \"name\": \"一関工業高等専門学校\",\n" +
                "    \"short_name\": \"一関\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30043,\n" +
                "    \"name\": \"仙台高等専門学校　広瀬キャンパス\",\n" +
                "    \"short_name\": \"仙台（広瀬）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30061,\n" +
                "    \"name\": \"仙台高等専門学校　名取キャンパス\",\n" +
                "    \"short_name\": \"仙台（名取）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30011,\n" +
                "    \"name\": \"秋田工業高等専門学校\",\n" +
                "    \"short_name\": \"秋田\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30024,\n" +
                "    \"name\": \"福島工業高等専門学校\",\n" +
                "    \"short_name\": \"福島\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30017,\n" +
                "    \"name\": \"茨城工業高等専門学校\",\n" +
                "    \"short_name\": \"茨城\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30016,\n" +
                "    \"name\": \"小山工業高等専門学校\",\n" +
                "    \"short_name\": \"小山\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30026,\n" +
                "    \"name\": \"群馬工業高等専門学校\",\n" +
                "    \"short_name\": \"群馬\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30003,\n" +
                "    \"name\": \"木更津工業高等専門学校\",\n" +
                "    \"short_name\": \"木更津\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30018,\n" +
                "    \"name\": \"東京工業高等専門学校\",\n" +
                "    \"short_name\": \"東京\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30040,\n" +
                "    \"name\": \"東京都立産業技術高等専門学校　品川キャンパス\",\n" +
                "    \"short_name\": \"産技（品川）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30047,\n" +
                "    \"name\": \"東京都立産業技術高等専門学校　荒川キャンパス\",\n" +
                "    \"short_name\": \"産技（荒川）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30049,\n" +
                "    \"name\": \"サレジオ工業高等専門学校\",\n" +
                "    \"short_name\": \"サレジオ\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30045,\n" +
                "    \"name\": \"長岡工業高等専門学校\",\n" +
                "    \"short_name\": \"長岡\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30059,\n" +
                "    \"name\": \"富山高等専門学校　射水キャンパス\",\n" +
                "    \"short_name\": \"富山（射水）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30052,\n" +
                "    \"name\": \"石川工業高等専門学校\",\n" +
                "    \"short_name\": \"石川\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30034,\n" +
                "    \"name\": \"福井工業高等専門学校\",\n" +
                "    \"short_name\": \"福井\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30048,\n" +
                "    \"name\": \"長野工業高等専門学校\",\n" +
                "    \"short_name\": \"長野\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30050,\n" +
                "    \"name\": \"岐阜工業高等専門学校\",\n" +
                "    \"short_name\": \"岐阜\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30033,\n" +
                "    \"name\": \"沼津工業高等専門学校\",\n" +
                "    \"short_name\": \"沼津\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30057,\n" +
                "    \"name\": \"豊田工業高等専門学校\",\n" +
                "    \"short_name\": \"豊田\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30046,\n" +
                "    \"name\": \"近畿大学工業高等専門学校\",\n" +
                "    \"short_name\": \"近畿\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30001,\n" +
                "    \"name\": \"鈴鹿工業高等専門学校\",\n" +
                "    \"short_name\": \"鈴鹿\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30007,\n" +
                "    \"name\": \"鳥羽商船高等専門学校\",\n" +
                "    \"short_name\": \"鳥羽\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30005,\n" +
                "    \"name\": \"舞鶴工業高等専門学校\",\n" +
                "    \"short_name\": \"舞鶴\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30054,\n" +
                "    \"name\": \"大阪府立大学工業高等専門学校\",\n" +
                "    \"short_name\": \"大阪\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30023,\n" +
                "    \"name\": \"神戸市立工業高等専門学校\",\n" +
                "    \"short_name\": \"神戸\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30028,\n" +
                "    \"name\": \"明石工業高等専門学校\",\n" +
                "    \"short_name\": \"明石\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30030,\n" +
                "    \"name\": \"奈良工業高等専門学校\",\n" +
                "    \"short_name\": \"奈良\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30039,\n" +
                "    \"name\": \"和歌山工業高等専門学校\",\n" +
                "    \"short_name\": \"和歌山\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30012,\n" +
                "    \"name\": \"米子工業高等専門学校\",\n" +
                "    \"short_name\": \"米子\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30009,\n" +
                "    \"name\": \"松江工業高等専門学校\",\n" +
                "    \"short_name\": \"松江\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30004,\n" +
                "    \"name\": \"津山工業高等専門学校\",\n" +
                "    \"short_name\": \"津山\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30035,\n" +
                "    \"name\": \"呉工業高等専門学校\",\n" +
                "    \"short_name\": \"呉\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30020,\n" +
                "    \"name\": \"徳山工業高等専門学校\",\n" +
                "    \"short_name\": \"徳山\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30002,\n" +
                "    \"name\": \"大島商船高等専門学校\",\n" +
                "    \"short_name\": \"大島\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30060,\n" +
                "    \"name\": \"宇部工業高等専門学校\",\n" +
                "    \"short_name\": \"宇都宮\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30053,\n" +
                "    \"name\": \"阿南工業高等専門学校\",\n" +
                "    \"short_name\": \"阿南\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30015,\n" +
                "    \"name\": \"香川高等専門学校　高松キャンパス\",\n" +
                "    \"short_name\": \"香川（高松）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30031,\n" +
                "    \"name\": \"香川高等専門学校　詫間キャンパス\",\n" +
                "    \"short_name\": \"香川（詫間）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30037,\n" +
                "    \"name\": \"弓削商船高等専門学校\",\n" +
                "    \"short_name\": \"弓削\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30006,\n" +
                "    \"name\": \"新居浜工業高等専門学校\",\n" +
                "    \"short_name\": \"新居浜\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30027,\n" +
                "    \"name\": \"北九州工業高等専門学校\",\n" +
                "    \"short_name\": \"北九州\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30056,\n" +
                "    \"name\": \"有明工業高等専門学校\",\n" +
                "    \"short_name\": \"有明\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30058,\n" +
                "    \"name\": \"久留米工業高等専門学校\",\n" +
                "    \"short_name\": \"久留米\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30041,\n" +
                "    \"name\": \"佐世保工業高等専門学校\",\n" +
                "    \"short_name\": \"佐世保\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30025,\n" +
                "    \"name\": \"熊本高等専門学校　熊本キャンパス\",\n" +
                "    \"short_name\": \"熊本（熊本）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30014,\n" +
                "    \"name\": \"熊本高等専門学校　八代キャンパス\",\n" +
                "    \"short_name\": \"熊本（八代）\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30022,\n" +
                "    \"name\": \"大分工業高等専門学校\",\n" +
                "    \"short_name\": \"大分\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30013,\n" +
                "    \"name\": \"都城工業高等専門学校\",\n" +
                "    \"short_name\": \"都城\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30036,\n" +
                "    \"name\": \"鹿児島工業高等専門学校\",\n" +
                "    \"short_name\": \"鹿児島\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30044,\n" +
                "    \"name\": \"沖縄工業高等専門学校\",\n" +
                "    \"short_name\": \"沖縄\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30062,\n" +
                "    \"name\": \"ハノイ国家大学\",\n" +
                "    \"short_name\": \"ベトナム\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30063,\n" +
                "    \"name\": \"モンゴル国立大学\",\n" +
                "    \"short_name\": \"モンゴル\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30064,\n" +
                "    \"name\": \"ペトロナス工科大学\",\n" +
                "    \"short_name\": \"マレーシア\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30065,\n" +
                "    \"name\": \"香港IVE\",\n" +
                "    \"short_name\": \"香港\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30066,\n" +
                "    \"name\": \"中京大学\",\n" +
                "    \"short_name\": \"中京大学\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30067,\n" +
                "    \"name\": \"豊橋技術科学大学\",\n" +
                "    \"short_name\": \"豊橋技科大学\"\n" +
                "  },\n" +
                "  {\n" +
                "    \"id\": 30068,\n" +
                "    \"name\": \"神戸大学\",\n" +
                "    \"short_name\": \"神戸大学\"\n" +
                "  }\n" +
                "]";
    }
}
